{"id":2168,"date":"2021-03-05T11:22:19","date_gmt":"2021-03-05T11:22:19","guid":{"rendered":"https:\/\/americanopt.com\/?p=2168"},"modified":"2021-03-15T09:48:13","modified_gmt":"2021-03-15T09:48:13","slug":"good-news-for-spouses-of-h-1b-visa-holders-biden-withdraws-h4-work-permits","status":"publish","type":"post","link":"https:\/\/americanopt.com\/2021\/03\/05\/good-news-for-spouses-of-h-1b-visa-holders-biden-withdraws-h4-work-permits\/","title":{"rendered":"Good News for spouses of H-1B visa holders, Biden withdraws H4 work permits"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">&#8220;Withdrawn&#8221; &#8211; the word of sigh<\/span><\/p>\n<p><span style=\"font-weight: 400;\">H4 visa holders could not legally get <\/span><b><a href=\"https:\/\/americanopt.com\/jobs\/\">H4 EAD<\/a> jobs<\/b><span style=\"font-weight: 400;\"> in America until the summer of 2015. According to the H4 EAD ruling, dependents of H1B visa holders having a valid H4 visa may work in the US by applying for Employment Authorization. Employment Authorization Document (EAD) for H4 visa holders allows H4 visa dependent spouses of H1B non-immigrants to legally get <\/span><a href=\"https:\/\/americanopt.com\/jobs\/\"><b>H4 EAD jobs<\/b><\/a><span style=\"font-weight: 400;\"> in the United States. Eligible H4 visa holders may then apply for H4 visa EAD if they want to work or start a business in the US.<\/span><\/p>\n\n\n<p>Effective May 26, 2015, the <strong><a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\">H4 EAD jobs<\/a><\/strong> rule was implemented to retain highly skilled foreign workers and decrease the interruption to US businesses that results from <strong><a href=\"https:\/\/americanopt.com\/submit-resume\/\" class=\"rank-math-link\">H1B job<\/a><\/strong> holders choosing not to stay in the US. The Department of Homeland Security (DHS) expects this new rule to reduce economic burdens and personal stresses among H1B non-immigrants and their families while transitioning to lawful permanent resident status.<\/p>\n\n\n\n<p>The Trump administration had proposed to revoke it as part of his anti-immigration policy. Since February 2019, the former President Donald Trump&#8217;s administration was moving to rescind the 2015 Obama-era <strong>H-4 Employment Authorisation Document (EAD) jobs<\/strong> rule. Trump&#8217;s efforts, which were in their last lap, would have rescinded this<a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\"> <strong>H4 EAD job<\/strong><\/a> work authorization, depriving around 1 lakh immigrant spouses of Indian origin.<\/p>\n\n\n\n<p>US vice president Kamala Harris, then a California senator, objected to this &#8220;outrageous&#8221; move, reported by Hindustan Times.<\/p>\n\n\n\n<p><em>&#8220;This is outrageous &amp; will force immigrant women who are doctors, nurses, scientists &amp; academics, among others, to abandon their professional careers. I called on DHS last year to withdraw this proposal &amp; will continue to fight this,&#8221; Kamala Haris had tweeted in February 2019.<\/em><\/p>\n\n\n\n<p>In this one tweet, she managed to sum the pain of 1,00,000 more Indians holding <strong><a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\">H4 EAD jobs<\/a><\/strong> and <strong><a href=\"https:\/\/americanopt.com\/submit-resume\/\" class=\"rank-math-link\">H1B jobs in the US<\/a><\/strong> along with giving them hope. Biden, on his day seven, introduces Bill giving automatic work authorization for spouses, therefore, turning tables. The Biden administration delivered a huge win for the dependents of the H-1B visa holders in America who spent the last four years worried. Nearly, a lakh Indian spouses can now breathe a sigh of relief as the H-1B visa holders can continue working in the US, according to reports.<\/p>\n\n\n\n<p>This opens up the chance for all H4 visa holders the opportunity to work and make use of their potential skills. This being said, <a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\"><strong>H4 EAD jobs<\/strong> <\/a>are easy to find and can get even easier if searched in the right place. One of the sites you can use is AmericanOPT. To apply for <strong><a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\">H4 EAD jobs<\/a><\/strong>, eligible H4 visa holders must file Form I-765, Application for Employment Authorization. Although, they could be very few reasons as to why an H4 visa holder could not find <strong><a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\">H4 EAD jobs<\/a><\/strong>. Some of which could be having a career gap, Lack of skill sets, Immense competition, Lacking the motivation to search for a job, Unprofessional Resumes, Lack of online branding of self, Lack of planning or Networking.<\/p>\n\n\n\n<p>The best way to deal with issues of getting an<strong> <a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\">H4 EAD job<\/a>, <a href=\"https:\/\/americanopt.com\/submit-resume\/\" class=\"rank-math-link\">H1 b jobs in the US<\/a><\/strong>, or any job for that matter, is to first start with planning. Plan your job search. Fix your resume. Prepare your resume such that it catches attention. Take your job search seriously. Looking for a job is a full-time job in itself. A person with no skill set eagerly looking for a job has more chances of getting a job than a person with a skill set but zero motivation to look for a job. Concentrate on your job search skills. If you haven&#8217;t studied in the US then getting an <strong><a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\">H4 EAD job<\/a> <\/strong>could be a challenge. Use portals and websites available for students that make job search easy and systematic. One such is AmericanOPT. This website could be a stop for all your job issues.<\/p>\n\n\n\n<p>Nonetheless, <strong><a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\">H4 EAD jobs<\/a><\/strong> are only possible if your spouse or a main person of the family has an <strong><a href=\"https:\/\/americanopt.com\/submit-resume\/\" class=\"rank-math-link\">H1-B visa job<\/a><\/strong> in the US. For <strong>H1-B jobs<\/strong> in the USA, we need to first understand what an H1-B visa is. The H-1B visa is a work permit that allows workers to go to the United States and work for American companies.<\/p>\n\n\n\n<p>The biggest challenge many face is how to find H1B visa sponsoring companies that can file H1B visas on their behalf and get your <strong><a href=\"https:\/\/americanopt.com\/submit-resume\/\" class=\"rank-math-link\">H1-B jobsin the US<\/a>.<\/strong> Probably the most logical way to find a sponsor is to apply for a job at a company that sponsors H1B Visas. You can use sites that avail this for you. Another way is to search for jobs at H1B Sponsoring companies at any US job site. Once you apply and get an offer, then you can seek them for H1B sponsorship and get yourself an <a href=\"https:\/\/americanopt.com\/submit-resume\/\" class=\"rank-math-link\"><strong>H1-B job in the US<\/strong><\/a> to apply for a petition this April.<\/p>\n\n\n\n<p>If you are in America and on an F1 visa, this is your choice. You need to find an internship or co-op at a company that can sponsor <strong><a href=\"https:\/\/americanopt.com\/submit-resume\/\" class=\"rank-math-link\">H1B jobs in the US<\/a><\/strong>. You can use the above two methods to create such a list of H1B sponsoring companies. Always make sure that the company that you pick up the internship from is willing to sponsor an H1B visa. Usually, if you would like to search for H1B Visa sponsors from India, this is your best bet. Apply for a role at any of the large global consulting companies like TCS, WIPRO, Infosys, etc., and make sure you negotiate about the H1B Visa sponsorship when you take the offer. Joining these companies, without a commitment from the manager is going to be difficult because internally there would be a very long queue of employees waiting for H1B Visa sponsorship. It is a little tough, but you just need to position yourself and your skills to get <strong><a href=\"https:\/\/americanopt.com\/submit-resume\/\" class=\"rank-math-link\">H1-B jobs in the US<\/a>.<\/strong><\/p>\n\n\n\n<p>Another way to get yourself jobs is on contract, i.e, <strong><a href=\"https:\/\/americanopt.com\/\" class=\"rank-math-link\">contract jobs in the US<\/a><\/strong>. Yes! You heard it right. If you are an Optional Practical Training student and are willing to take advantage of the Optical Practical Training(OPT) extension to your F-1 student visa in the US, you&#8217;ll need a job related to your field of study. Students can also use sites like AmericanOPT to get assistance. Recent grads are considering <strong><a href=\"https:\/\/americanopt.com\/\" class=\"rank-math-link\">contract jobs in the US <\/a><\/strong>to make the most of their time in the US, however, will need to pay attention to visa regulations to maintain their status while in the country. Contract work after your US master&#8217;s isn&#8217;t as straightforward as full-time employment with a single company. If you want to get <strong><a href=\"https:\/\/americanopt.com\/\" class=\"rank-math-link\">contract jobs in the US<\/a><\/strong> &#8211; your best bet is to wait until you receive a Green Card. If that&#8217;s your goal (contract work or otherwise), it&#8217;s time to build your credit in the US.<\/p>\n\n\n\n<p>With increasing competition, there is also an increase in ways to complete the lap first. Whether it is <strong><a href=\"https:\/\/americanopt.com\/jobs\/\" class=\"rank-math-link\">H4-EAD jobs<\/a>, <a href=\"https:\/\/americanopt.com\/submit-resume\/\" class=\"rank-math-link\">H1b visa jobs<\/a>, or <a href=\"https:\/\/americanopt.com\/\" class=\"rank-math-link\">contract jobs in the US<\/a><\/strong>, one has to work hard, use job search sites that land them on the right platforms, and explore their options.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Withdrawn&#8221; &#8211; the word of sigh H4 visa holders could not legally get H4 EAD jobs in America until the summer of 2015. According to the H4 EAD ruling, dependents of H1B visa holders having a valid H4 visa may work in the US by applying for Employment Authorization. Employment Authorization Document (EAD) for H4 &hellip; <br \/><a href=\"https:\/\/americanopt.com\/2021\/03\/05\/good-news-for-spouses-of-h-1b-visa-holders-biden-withdraws-h4-work-permits\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Good News for spouses of H-1B visa holders, Biden withdraws H4 work permits<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":2170,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_bbp_topic_count":0,"_bbp_reply_count":0,"_bbp_total_topic_count":0,"_bbp_total_reply_count":0,"_bbp_voice_count":0,"_bbp_anonymous_reply_count":0,"_bbp_topic_count_hidden":0,"_bbp_reply_count_hidden":0,"_bbp_forum_subforum_count":0},"categories":[126],"tags":[],"_links":{"self":[{"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/posts\/2168"}],"collection":[{"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/comments?post=2168"}],"version-history":[{"count":1,"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/posts\/2168\/revisions"}],"predecessor-version":[{"id":2169,"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/posts\/2168\/revisions\/2169"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/media\/2170"}],"wp:attachment":[{"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/media?parent=2168"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/categories?post=2168"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/americanopt.com\/wp-json\/wp\/v2\/tags?post=2168"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}